# SquareFeetPerFoot Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..SquareFeetPerFoot Property
UnitTypeId Class See Also
---
Square feet per foot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId SquareFeetPerFoot { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SquareFeetPerFoot As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SquareFeetPerFoot {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace